================================================================================
Command without arguments
================================================================================

\foo bar

--------------------------------------------------------------------------------

(source_file
  (command
    (command_name))
  (text
    (word)))

================================================================================
Command with one curly argument
================================================================================

\foo{bar}

--------------------------------------------------------------------------------

(source_file
  (command
    (command_name)
    (curly_group
      (text
        (word)))))

================================================================================
Command with one curly argument and one mixed argument
================================================================================

\foo{bar}[baz]

--------------------------------------------------------------------------------

(source_file
  (command
    (command_name)
    (curly_group
      (text
        (word)))
    (mixed_group
      (text
        (word)))))

================================================================================
Command with nested paren argument
================================================================================

\foo([bar])

--------------------------------------------------------------------------------

(source_file
  (command
    (command_name)
    (mixed_group
      (mixed_group
        (text
          (word))))))

================================================================================
Command with incomplete argument
================================================================================

\foo{ \begin{document} \end{document}

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (command_name)
    (environment
      (begin
        (command_name)
        (curly_group_text
          (text
            (word))))
      (end
        (command_name)
        (curly_group_text
          (text
            (word)))))))

================================================================================
Acroynm definition
================================================================================

\newacronym[foo={bar}]{gcd}{GCD}{Greatest Common Divisor}

--------------------------------------------------------------------------------

(source_file
  (acronym_definition
    (command_name)
    (brack_group_key_value
      (key_value_pair
        (key
          (word))
        (value
          (curly_group
            (text
              (word))))))
    (curly_group_text
      (text
        (word)))
    (curly_group
      (text
        (word)))
    (curly_group
      (text
        (word)
        (word)
        (word)))))
