===
basic ident
===

do sample

---

(source_file
  (module_function_or_value_defn
    (do_expr (long_identifier (identifier)))))

===
ident with numbers
===

do wh0ar3y0u

---

(source_file
  (module_function_or_value_defn
    (do_expr
      (long_identifier (identifier)))))

===
tick ident
===

do ``I can have anything in here ASDFAS?DFS``

---

(source_file
  (module_function_or_value_defn
    (do_expr (long_identifier (identifier)))))

===
ident with leading _
===

do _yo

---

(source_file
  (module_function_or_value_defn
    (do_expr (long_identifier (identifier)))))

===
long ident
===
module test = foo.bar.baz
---

(source_file
  (module_abbrev
      (identifier)
      (long_identifier
        (identifier)
        (identifier)
        (identifier))))

===
long ident with tick
===
module _ = foo.bar.``baz``
---
(source_file
  (module_abbrev
      (identifier)
      (long_identifier
        (identifier)
        (identifier)
        (identifier))))
