===
basic module with indent
===

module test =
 let x = 4

---

(file
  (module_defn
    (identifier)
    (value_declaration
      (value_declaration_left
        (pattern (identifier)))
      (defn_body (int)))))

===
basic module with large indent
===

module test =
                      let x = 4

---

(file
  (module_defn
    (identifier)
    (value_declaration
      (value_declaration_left
        (pattern (identifier)))
      (defn_body (int)))))

===
basic module with multiple elements
===

module test =
 let x = 4
 let y = 5

---

(file
  (module_defn
    (identifier)
    (value_declaration
      (value_declaration_left
        (pattern (identifier)))
      (defn_body (int)))
    (value_declaration
      (value_declaration_left
        (pattern (identifier)))
      (defn_body (int)))))

===
top-level module with multiple elements
===

module Test

let x = 4
let y = 5

---
(file
  (named_module
    name: (long_identifier
      (identifier))
    (value_declaration
      (value_declaration_left
        (pattern
          (identifier)))
        (defn_body (int)))
    (value_declaration
      (value_declaration_left
        (pattern
          (identifier)))
        (defn_body (int)))))
